---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemAnchorDiameter
source: html/c059270f-5589-aa73-48cd-4c3265dcde72.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemAnchorDiameter Property

"Diameter"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemAnchorDiameter { get; }
```